{
  "data": [
    {
      "id": "70b85ccf-e1a1-47b7-a672-28fc142d2ec1",
      "userName": "Joe S",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWV73saoyupLToN4fm_FXJbJOzVY9NGQsXLfn0rtCbIxT8",
      "date": "2024-02-20T15:05:38.569Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=70b85ccf-e1a1-47b7-a672-28fc142d2ec1",
      "title": null,
      "text": "It's well designed but it's just another pointless time waster. I was hoping there'd be some sort of strategy like buying properties to compete against other people but it's just completely random. You roll the dice over and over again and get seemingly random quantities of money and then you tap on properties to upgrade them... And that's it. That's the game. That and pop-ups trying to get you to buy more turns and money so you can do more pointless dice rolling and property \"upgrading.\"",
      "replyDate": "2024-02-21T01:16:12.403Z",
      "replyText": "Hello Joe S! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 92,
      "criterias": [
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        }
      ]
    },
    {
      "id": "4a30a8e4-6372-4846-b8d4-35086ef99299",
      "userName": "Sheldon Munns",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJu_uvj20iIUEcTvN8TJr5nDh88zofnFTPmVrJfECs=mo",
      "date": "2024-02-19T21:48:46.608Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=4a30a8e4-6372-4846-b8d4-35086ef99299",
      "title": null,
      "text": "It starts off fun. I loved being able to collect and trade stickers to complete the albums. Trading is one of the funnest parts, until you get stuck on needing gold cards that cant be trading unless they do a gold blitz, which they dont always do. It quickly became apparent the game is rigged, nothing is random. Can't stand games that take no skill, then they intentionally make obstacles in order to have to pay them! Poor game design requiring you to pay to win! I think I am done!",
      "replyDate": "2024-02-19T23:13:47.465Z",
      "replyText": "Hello Sheldon! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 152,
      "criterias": []
    },
    {
      "id": "4ebd2f10-8e48-472b-970d-8352653d1fcf",
      "userName": "Joydivison39 !",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXHigh3HzRu4JjeiCbH14Dht99IHnQ4oHTsXjhoVqTQzJQ",
      "date": "2024-02-21T14:47:00.666Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=4ebd2f10-8e48-472b-970d-8352653d1fcf",
      "title": null,
      "text": "Monopoly Go is getting stale, it needs a larger variety of mini games. The same 2 mini games for almost a year is criminal. Cash grab as a timed event? Wth? That is not worth it, it should be a mini game for the railroad. Don't waste your time on this game if you expect something new and refreshing. It's the same thing over and over again. No new major changes.",
      "replyDate": "2024-02-22T03:48:50.664Z",
      "replyText": "Hello Joydivison39! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "e2f9c1a5-3c4e-4495-90ba-eb1da932875b",
      "userName": "Teresa Upton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKXbWMf9RWBM4sdNcnYJ2xq5e-YBPfVhqrHTOQ4WMn6=mo",
      "date": "2024-02-21T06:40:48.881Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=e2f9c1a5-3c4e-4495-90ba-eb1da932875b",
      "title": null,
      "text": "It was fun in the beginning. The farther you get in the game the more it takes to finish a board. No matter how much it costs to finish a round you only get 50 dice in return. Stickers are more difficult to get and it costs too many rolls to get anything on the top rewards. Partner events are harder to get points for as well. I'm very close to giving up on this game altogether.",
      "replyDate": "2024-02-21T09:08:19.285Z",
      "replyText": "Thanks for your feedback, Teresa. We appreciate you sending us this concern regarding the game and apologize if this affects your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 14,
      "criterias": []
    },
    {
      "id": "3dbde164-1cce-43ed-9a97-600afb74a523",
      "userName": "Lisa Itarelli (Lee)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVd070axbI3NZv8N0e5dB6U_2xFbxsfbRbjiQmS611zOc8",
      "date": "2024-02-20T14:24:34.719Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=3dbde164-1cce-43ed-9a97-600afb74a523",
      "title": null,
      "text": "Been playing this game about a year. They fixed the trading so that you can trade in game which is great. The only thing is the likelihood of landing on special tiles is so low. I understand it's a free game and they bank on people spending money because let's face it this is a gambling addiction crutch. But come on.. I have lost so many events and being so close and getting nothing. It's frustrating, yet addicting.",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 34,
      "criterias": [
        {
          "criteria": "vaf_games_subject_animal",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_content_language",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 3
        }
      ]
    },
    {
      "id": "fa75f2e3-8832-422f-b4fe-d2330752fcf6",
      "userName": "Laura Bishop",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVVy1Y4M18FuhRt8zy3VdC2g6nSfX8N67PddNX5ilUkHoc",
      "date": "2024-02-20T21:13:02.367Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=fa75f2e3-8832-422f-b4fe-d2330752fcf6",
      "title": null,
      "text": "Updated review: Feb 20, 2024. The new update took it from bad to worse! It is impossible to get anywhere with this game. Constantly lands on NOTHING! I've heard they've made changes to try to stop airplane mode cheating or something but it has really made the game even worse! Looking for something else to play because this is too much aggravation and a waste of time. Not even remotely fun anymore!",
      "replyDate": "2024-01-08T08:25:01.738Z",
      "replyText": "Hello Laura Bishop! Thank you for sharing your thoughts with us. We are doing our best to keep a good gameplay experience, so that everything inside the game can be obtained or achieved, no matter if you are a paying player or not. Of course, we hear you, and we will be looking for opportunities to improve our game further.",
      "version": "1.17.0",
      "thumbsUp": 8,
      "criterias": []
    },
    {
      "id": "685f0862-b865-49a7-ae44-dddf300d7403",
      "userName": "Pablo Bustamante",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVw_F6YqNFoD5DP90d9vbbGCngKUvCmp-2Vre33GrqjuQ",
      "date": "2024-02-18T22:14:48.615Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=685f0862-b865-49a7-ae44-dddf300d7403",
      "title": null,
      "text": "Downloaded the game because Co-workers wanted to play. Can't play with them because there is no way to add friends. Even when I try to add through contacts. They don't get the messages and even though they are in my contacts and play the Monopoly Go. They still won't add to my friends list even when the game says they'll be automatically added if someone in my contacts plays. What's the point of having a user ID if I can't add friends with a user ID.",
      "replyDate": "2024-02-19T09:47:40.702Z",
      "replyText": "Hello Pablo Bustamante! We are sorry to hear that you're experiencing this issue in the game. Please contact our support team at monopoly-go-support@scopely.com so we can better assist you.",
      "version": "1.17.0",
      "thumbsUp": 7,
      "criterias": []
    },
    {
      "id": "699cb38b-3b03-495a-ae8a-211d8a241383",
      "userName": "Nina Jacobs",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocItPC1d687QUvSzs73h5aVXKGPPCes8JlXiOLHqOByE=mo",
      "date": "2024-02-19T15:47:07.882Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=699cb38b-3b03-495a-ae8a-211d8a241383",
      "title": null,
      "text": "Having a hard time doing anything, can't get the stickers needed to complete anything. Tournaments are impossible to get close to winning due to scammers always ranking top with ridiculous amounts of points. Un beatable. You have to roll ridiculous amounts of times to land on anything.. when a challenge requires you to land on a specific tile, you will NEVER land on that tile. Once the challenge switches, you'll land ONLY on the tiles from previous challenge. Ridiculous and rigged.",
      "replyDate": "2024-02-20T08:26:58.833Z",
      "replyText": "Thanks for your feedback, Nina. We appreciate you sending us this concern regarding the game and apologize if this affects your progress. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 15,
      "criterias": []
    },
    {
      "id": "e459b7c3-446a-457a-9cae-73f3ea649d57",
      "userName": "Delaina Fontanez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKyMCy2oLq0MtFJRGj7AFkmJecnPQ5y7LJwMI4kXYyg=mo",
      "date": "2024-02-14T23:03:23.199Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=e459b7c3-446a-457a-9cae-73f3ea649d57",
      "title": null,
      "text": "5 stars to 3. I've not had a storefront to claim the every 8 hours prizes ever. Others I play with do. I've updated and tried removing and installing the game again. Now it's incredibly hard to finish partnered games even when the partner is helping. It's becoming tiresome. Edited: 2/14/24. Dropping to one star after free spin space was removed from partnered event. It's pointless to play this game at this point unless you plan on buying a ton of extras. Any more changes like that I'm done.",
      "replyDate": "2023-12-29T10:43:00.680Z",
      "replyText": "We are sorry to hear about the gameplay issues you've experienced, Delaina. Please rest assured that our team is working hard to fix any gameplay issues to keep a fair gameplay. If issue still persists, kindly contact us from inside the game or at monopoly-go-support@scopely.com. Looking forward to your message.",
      "version": "1.17.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "b8dde221-e599-4128-acc0-107099ffae53",
      "userName": "Corrie Morale",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWakxUcc-INCf5cuhPhnqcHebwLVv13qwgrKql4ZuF8TN7n",
      "date": "2024-02-13T18:20:20.546Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=b8dde221-e599-4128-acc0-107099ffae53",
      "title": null,
      "text": "I really enjoyed this game for the first 75-100 levels! It had moments of frustration based on \"chance\", but it didn't feel like progression was unattainable! Even the sticker collections seemed possible to complete through networking and trading with other players. However, recently I feel the odds are not in the favor of patrons. Ever. I've spent a fair amount of money on this game for rolls AND stickers, but constantly come away with duplicates, and little progression. It is not fun anymore.",
      "replyDate": "2024-02-14T06:04:09.566Z",
      "replyText": "Hello Corrie! Thank you for your feedback. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 339,
      "criterias": []
    },
    {
      "id": "a0a24ec9-a006-4bf4-9bde-1ca6966b0270",
      "userName": "Kevin Cline",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyP4z-noUrTKmnVnbPkR33gLS06AKbgpgH1OL9CilGweY",
      "date": "2024-01-27T13:28:39.380Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=a0a24ec9-a006-4bf4-9bde-1ca6966b0270",
      "title": null,
      "text": "ADS, ADS ADS! Seriously, every time you open the app or run out of rolls, you get bombarded with no less than three pop-ups. To make things worse, the exit button for them are all in different locations so you can't rapidly exit them. Especially if you're playing one handed. I've never have seen a game so full of itself try to force itself down your throat.",
      "replyDate": "2024-01-29T07:24:45.151Z",
      "replyText": "Hi there Kevin Cline! We appreciate you taking the time to share your thoughts with us the pop-up features in the game. Rest assured that this will be shared with the team for further consideration so please kindly stay tuned for now.",
      "version": "1.16.0",
      "thumbsUp": 1294,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "bda1f179-bfc6-481e-bc46-f1b90b32b49d",
      "userName": "Amy Whitney",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ9AaT8q7dOlB6HbMTdSTINtat7tLEDqpNOofSaZSBQ=mo",
      "date": "2024-02-15T00:12:06.324Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=bda1f179-bfc6-481e-bc46-f1b90b32b49d",
      "title": null,
      "text": "I really enjoy playing this, but I do have 2 complaints. 1st, you hardly get any new stickers after the 1st week of the new sets. 2nd, in the partner tournaments it's super hard to get the objects to collect in order to get through building the things with your partners before the tournament is over. The last 3 I have struggled in order to just finish one let alone four and then having to use at least 20 objects for one spin makes it impossible!",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 44,
      "criterias": []
    },
    {
      "id": "4bc69cb3-3443-4fa8-87c4-0bd0a0df0171",
      "userName": "Breeana Brunken",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXF57a-U35CmaheG-lJPucfBcMC-Aneb5f6zsdduBkjTQ",
      "date": "2024-02-16T04:07:34.254Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=4bc69cb3-3443-4fa8-87c4-0bd0a0df0171",
      "title": null,
      "text": "Pretty stupid that I get told which gold stickers I'm allowed to share. Also I'm always landing on go and jail until I NEED to. Then suddenly I don't. I'm always 34th in the challenges, but I level up so much. Still hard to do anything with 80 spins a day -.- 8 rolls an hour? Most games give 1 \"move\" every 2-3 minutes. It's like they don't want people playing the game. Most people aren't going to pay money for games. If you want to get beat by a computer, it's a great game.",
      "replyDate": "2024-02-16T06:07:33.150Z",
      "replyText": "Thanks for your feedback, Breeana. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 42,
      "criterias": []
    },
    {
      "id": "cdaed629-6617-4fa6-80bd-bf75216f121f",
      "userName": "Timia Tink Bell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWWg9HLDzAh34333In2fNs3-w-zb6Ia6sKlSeC3muJ5GJM",
      "date": "2024-02-17T17:16:17.630Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=cdaed629-6617-4fa6-80bd-bf75216f121f",
      "title": null,
      "text": "Fun at first. My issue is that with bank heist it's the same people all the time on your friend list but the ones who are committing heist against you are not. Don't have dame ability as you do with shutdowns which you can choose random options. Then it's the card collection, it continues to give the same cards over and over.... so what's the point. It's repetitive at this point. So it's not fun because it remain the same. All task are not possible to complete also.",
      "replyDate": "2024-03-08T08:26:40.358Z",
      "replyText": "Hi Timia Tink Bell! Thank you for sharing your thoughts about the gameplay which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 58,
      "criterias": []
    },
    {
      "id": "40f929c8-b15f-4116-9545-cbbb53cff551",
      "userName": "C C",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLJrdWyZDg8nXLuTmHWjjUPxMS4FHkepH9_cPJmCAjgOA=mo",
      "date": "2024-02-16T09:03:12.706Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=40f929c8-b15f-4116-9545-cbbb53cff551",
      "title": null,
      "text": "Best to play without competing because the game feels rigged during incentives and tournaments, meaning when you get prizes your definitely going to have a hard time landing on what you need so you waste tons of precious dice most of the time to not even get the reward. This game can be extremely frustrating. Plus it makes you steal tons of money from your friends, not others playing, but your friends. I'm putting it on pause due to the stress it causes. Update didn't fix problems either.",
      "replyDate": "2024-02-23T08:48:37.811Z",
      "replyText": "Thanks for your feedback, C C. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 21,
      "criterias": []
    },
    {
      "id": "a8d735b2-a552-46b3-97ac-3da5b99f46fa",
      "userName": "Michael H",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJ633wJApt-pDUM3RYGR1wvZojjsFCW0xtbd2bZ-WWV=mo",
      "date": "2024-02-05T15:35:37.482Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=a8d735b2-a552-46b3-97ac-3da5b99f46fa",
      "title": null,
      "text": "It was fun for about the first 100 levels. It moved along fairly quickly and rewards were plenty. But then everything gets incredibly expensive and it's extremely difficult to build up the game money to progress. I also don't mind a little bit of a challenge in a game, but good luck finishing an album set! It feels like it would be easier winning the lottery. You get duplicate after duplicate for cards. Yes, you can purchase additional rolls, but 99.00 for 3200 rolls?!?! I think Im done.",
      "replyDate": "2024-02-06T10:18:56.733Z",
      "replyText": "Thanks for your feedback, Michael. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 4258,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_board",
          "rating": 1
        }
      ]
    },
    {
      "id": "30c10560-a9a8-4871-b5ab-e14e51e4cdd4",
      "userName": "Tonya Robertson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocICVDjRqBz-_5HkwP-SmrzdbZyMxD3URsWVpHH3PL4f=mo",
      "date": "2024-02-14T22:04:33.908Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=30c10560-a9a8-4871-b5ab-e14e51e4cdd4",
      "title": null,
      "text": "Used to be FUN! Not anymore!! As you get further along in the game everything gets harder but the prizes are nothing more than what you got in the beginning. The last 2 partner challenges were virtually impossible to complete without spending hundredsof dollars on more dice. Mr. M just wants your money. Even when you open the app there are like 3-4 pop-ups of things to buy...every single time!! Think it's time to find another game.",
      "replyDate": "2024-02-14T23:36:08.780Z",
      "replyText": "Hello Tonya! Thank you for sharing your thoughts about the game. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 51,
      "criterias": []
    },
    {
      "id": "313c9386-b8c1-4ba7-8f74-8b14138f1697",
      "userName": "Laysha Laya",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWVAdfGi8DiKDc7EVhsEYftZKqQhVvPrtlAFKX8Y_JuhiM",
      "date": "2024-02-17T19:53:29.848Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=313c9386-b8c1-4ba7-8f74-8b14138f1697",
      "title": null,
      "text": "I really use to love this game but now it's getting a bit annoying. I swear every time you play and love a game, they always seem to make horrible changes. The worse one is them doubling the points needed to finish the partner events. Everyone are already at different levels and can play differently so the 40k needed was more than enough. Now it's 80k and I can barely even finish 1/4. Hope they change this really soon or I'm done completely even trying!",
      "replyDate": "2024-03-08T08:39:50.651Z",
      "replyText": "Hi Laysha Laya! Thank you for sharing your thoughts about the partner event changes which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 46,
      "criterias": [
        {
          "criteria": "vaf_games_genre_dice",
          "rating": 1
        }
      ]
    },
    {
      "id": "ed308b4b-5305-44b7-be9e-e0c7e5aaf5fe",
      "userName": "Gigi Jimenez",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUyEraWsUjdDhnM0LMDcEXn6rV-WF47GKjK4GFBuwsFmnc",
      "date": "2024-02-16T16:23:07.806Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ed308b4b-5305-44b7-be9e-e0c7e5aaf5fe",
      "title": null,
      "text": "It's a fun game and for a while it was great!! However, the game gets really expensive really fast! Dice $99 for 3200 is insane. And you play & play and never seem advance. The collection of cards are very repetitive it's almost impossible to finish albums. Even during the events, no new cards were received! It's a waste of time & money!!!",
      "replyDate": "2024-02-17T01:26:41.196Z",
      "replyText": "Hello Gigi! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.16.0",
      "thumbsUp": 12,
      "criterias": []
    },
    {
      "id": "c59ccde9-e3b2-4bf8-a184-1b995c6954c3",
      "userName": "Lori Salgado",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVX4qF2mcTA-34hKQyxZJx7WaA1ibBPzqsNp1S1xiao7mds",
      "date": "2024-02-14T16:00:31.689Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=c59ccde9-e3b2-4bf8-a184-1b995c6954c3",
      "title": null,
      "text": "Love the game, as most I'm sure. At the beginning, there was plenty of opportunity to get ahead, but once you make your first purchase, the winnings begin to be less and less. The amount charged is very high considering there is nothing you get out of it. Also during the events, you used to land more on winning buttons to advance like hearts to make the cakes, now you don't get as many and the spins always land on the lowest numbers.",
      "replyDate": "2024-02-17T05:19:51.480Z",
      "replyText": "Hello Lori! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 26,
      "criterias": []
    },
    {
      "id": "4762c4d6-5931-4399-9b3a-607216b0012f",
      "userName": "Serpintina",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVt74PUTL_6Fu6hura809URBZD8rGmDyYywyZKrZlLh4Ys",
      "date": "2024-02-15T04:57:39.384Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=4762c4d6-5931-4399-9b3a-607216b0012f",
      "title": null,
      "text": "This is a fun game but don't expect to finish any of the sticker sets without help. The latest update has completely screwed the game. It will not load and I can't even see most of the screen now. I don't want to lose all the stuff I have so I don't want to delete...but damn it was working fine and had to update an now frozen screens... They Fixed the issue with the not loading.",
      "replyDate": "2023-12-03T09:16:37.406Z",
      "replyText": "Hello there Serpintina! Thanks for your feedback. We appreciate you for taking the time to share your thoughts with us on how we can better improve your gameplay experience. Rest assured that your feedback is heard and will be shared with the team. Thank you for playing Monopoly GO!",
      "version": "1.16.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "1a3b0ec9-06d9-4cd3-942c-513d0e3d8942",
      "userName": "Linda Watson",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK8LQa4EGNtfY7svuRi-zM1dfvnwsFPZ1lwDWThK7VY=mo",
      "date": "2024-02-14T15:50:39.603Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=1a3b0ec9-06d9-4cd3-942c-513d0e3d8942",
      "title": null,
      "text": "Use to be fun. My favorite was the cool mini games. Now there's not enough opportunities to collect enough points to spin. Bad enough it takes 20 points for only 1 spin, but, just mostly land on 60 or 80 it takes more spins to get enough points. I haven't been able to complete all 4 since the very 1st one I played almost a year ago. No matter how much I play & no matter how many dice rolls I've bought, can't even get close. Considering uninstalling this game, no fun losing all the time. ☹️",
      "replyDate": "2024-02-15T09:39:41.129Z",
      "replyText": "Thanks for your feedback, Linda. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 566,
      "criterias": [
        {
          "criteria": "vaf_games_genre_board",
          "rating": 1
        },
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "f786ff66-88b7-4db9-a50c-f27161ff1233",
      "userName": "Jerron Joseph",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXAqLP_9mAhYG8ZxiOBFefELH5PFH4QawbCFxQXwyDlzOw",
      "date": "2024-02-15T04:30:15.443Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=f786ff66-88b7-4db9-a50c-f27161ff1233",
      "title": null,
      "text": "The game was interesting to play with friends but it became clear very quickly that the game is NOT random. And now it looks like EVERYTHING is predetermined. The game crashes and resets quite often. Additionally, I realize Scopely wants you to spend on their pack offerings but they are not commensurate to the price. Don't spend your hard earned money here. I am going to stop playing after this album.",
      "replyDate": "2024-02-15T12:32:22.755Z",
      "replyText": "Thanks for your feedback, Jerron. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 18,
      "criterias": []
    },
    {
      "id": "3198a630-adae-43c0-b41f-8a11812f14b1",
      "userName": "Amber Rascovich",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUkN3qnAZbQXgFw6FHFT5AHvtHy1eurS9hqIz8QUAhZem7G",
      "date": "2024-02-14T13:46:37.210Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=3198a630-adae-43c0-b41f-8a11812f14b1",
      "title": null,
      "text": "Over it. It rarely gives you new cards, it wants to charge you just to incentivize you to get passed certain points and the partners game is a joke. It's so hard to collect enough pieces to rack up points and when you do, the wheel never gives you enough to make a difference. Monopoly indeed. Don't spend money unless you like to loose and enjoy being pissed off. Three stars only because it's a lot of fun when you have enough dice to play, but you have to pay for the extra dice so....",
      "replyDate": "2024-02-17T06:08:30.600Z",
      "replyText": "Hello Amber! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 41,
      "criterias": []
    },
    {
      "id": "00c191ae-27be-4229-be91-eb17ab30cedf",
      "userName": "MoBayCo Mama",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU32pYvkcEizAi7aLQcfgXv_XAKOzqs5p2bMN5AaF9MSsI",
      "date": "2024-02-15T21:45:39.246Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=00c191ae-27be-4229-be91-eb17ab30cedf",
      "title": null,
      "text": "Love the Game!! I play with Family and Friends from all over the world!! I'm having an issue with the new update my game shuts down every couple minutes or so and I have to open back up to play. Usually when I get the train before I hit a landmark or right as a heist is starting. I've updated to the newest version and it seems like it's worse. I've been kicked off 7x in less than a 5 min period.",
      "replyDate": "2024-02-08T08:50:33.329Z",
      "replyText": "Hello MoBayCo Mama! Thank you for reporting the issue you encountered with the recent game update. Most performance-related issues can be resolved with some basic troubleshooting steps. If the issue persists, please contact us at monopoly-go-support@scopely.com so we can better assist you.",
      "version": "1.17.0",
      "thumbsUp": 6,
      "criterias": [
        {
          "criteria": "vaf_games_dimensional_plane_3d_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "9140d1a1-90e6-4f56-9bdc-4aad6a2d8063",
      "userName": "Justin King",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUD0IjErW5FQ2d3T1A2qD5QG9pc9uDJSx8E3UoEwjbg2RrB",
      "date": "2024-02-13T19:26:03.630Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=9140d1a1-90e6-4f56-9bdc-4aad6a2d8063",
      "title": null,
      "text": "OK, it's a fun game, well done to keep the pace up, I think the gameplay itself is well done. BUT... When I log in to play, I have to close at least 10 separate popups for events, rewards, updates, tournaments, games, prizes, side quests....I just did this, and it annoyed me to frustration. I mean, come on guys .... It's a little overkill, dontchathink?!? It's honestly an uninstallable trait.",
      "replyDate": "2024-02-14T04:24:19.571Z",
      "replyText": "Hello Justin! Thank you for your feedback. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 494,
      "criterias": []
    },
    {
      "id": "1d386c67-1f81-4a92-995d-129e961ddfe9",
      "userName": "Lee Diogeneia (True)",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVo0ylktlERDVjkCVO6BEVfdJEQB5VpfcyI7LRPjW4dmVI",
      "date": "2024-02-20T21:01:23.750Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=1d386c67-1f81-4a92-995d-129e961ddfe9",
      "title": null,
      "text": "I've had enough. The game started out fun, but Scopely keeps tweaking it so that you can't win big at anything without spending _copious_ amounts of $$. There is no element of chance. Further, it's not close to Monopoly the board game, yet it still manages to bring out the worst in some people, particularly in the Facebook group you HAVE to join to complete \"sticker sets.\" (Stickers??) Exercise your right in a free market and just don't download this. This is just a branded gambling app.",
      "replyDate": "2023-11-21T08:18:00.500Z",
      "replyText": "Hi there Lee Diogeneia. We appreciate you taking the time to share your thoughts with us on how we can better improve your gameplay experience. Rest assured that this will be shared with the team for further consideration so please kindly stay tuned for now.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 3
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 3
        }
      ]
    },
    {
      "id": "c5eaa2ec-b675-4d86-b1ad-17d69051268e",
      "userName": "Kurt !",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWjQmzKcJEIYrC7BqtKs1oDYagXrTGUFsMKFQbRviIiCYs",
      "date": "2024-02-14T20:04:00.354Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=c5eaa2ec-b675-4d86-b1ad-17d69051268e",
      "title": null,
      "text": "Over these events that are unfinishable unless you spend a ton of money. Make it easier to get the flowers or hearts or whatever item is needed for a wheel spin. Fun for about the first 75 boards but after that you just have to spend money to get anywhere. Second event in a row that I wasn't able to finish even with four good partners. Uninstalling.",
      "replyDate": "2024-02-15T02:14:22.107Z",
      "replyText": "Hello Kurt! Thank you for sharing your thoughts about the game. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 21,
      "criterias": []
    },
    {
      "id": "9d250c1f-505c-4469-a63a-164538e6d344",
      "userName": "Kathleen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUDZBD7d7QzWDlpwFh05VO88my6k-c4173sfIWBTjyT5w",
      "date": "2024-02-21T04:10:32.496Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=9d250c1f-505c-4469-a63a-164538e6d344",
      "title": null,
      "text": "Editing my previous review. Love the Pegee Pachinco Game! I'm now irritated by pop-ups. Some interfere with play. No need for so many. Also the metered game on the side, isn't accurate. The needle moves back. AND there needs to be more ways to win dice. There have been several instances where i land on a should on the board. The one that gives you back the amount of rolls you're playing. Ive played 10x and gotten only 6 back. I've rolle 5x and gotten three back etc.",
      "replyDate": "2024-01-06T17:59:08.427Z",
      "replyText": "Hello Kathleen! Thank you for sharing your thoughts with us. We understand that this can improve your gameplay experience. Rest assured that this information will be shared with the team for future game development.",
      "version": "1.17.0",
      "thumbsUp": 44,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        },
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "fca64697-ab35-4c74-93bd-bf7955bfd84b",
      "userName": "Da'marqus Flounery",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWw-cW_3ETyp8hHI55OuyJhGeq9UjYeOK30tDYyuhs61hQ",
      "date": "2024-02-10T13:04:08.966Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=fca64697-ab35-4c74-93bd-bf7955bfd84b",
      "title": null,
      "text": "The Game is fun and addicting but once you get pretty far in the game it starts to become a pay to win/play game. Especially when you get such a small amount of rolls every hour so unless you're getting rewards which is also becoming way more difficult then you play for maybe 5 minutes and then you're done for the day. The stickers are way too ridiculous to the point where you have a very small chance to finish it as well.",
      "replyDate": null,
      "replyText": null,
      "version": "1.16.0",
      "thumbsUp": 40,
      "criterias": []
    },
    {
      "id": "af8c4c5f-fcb4-461d-8211-be3d93c21604",
      "userName": "Mallory Boyce",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX6esGPMJSztDn0KOnhNMmm0OCgYg44LDo4A9fLKn-hsOU",
      "date": "2024-02-14T21:49:17.664Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=af8c4c5f-fcb4-461d-8211-be3d93c21604",
      "title": null,
      "text": "I used to enjoy it, but with every update, they blatantly and intentionally make it more and more rigged to force you to spend money. Before, you could casually play and push a bit to complete the mini games and events. Now, you can't succeed unless you play every waking moment and spend money. Enjoy it casually if you want, but don't expect to get to the end of any of the mini games without giving up a kidney. Everyone I've played with since last year have quit now because of this.",
      "replyDate": "2024-02-14T23:44:00.986Z",
      "replyText": "Hello Mallory! Thank you for sharing your thoughts about the game. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 27,
      "criterias": [
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 2
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "76d84347-c7ca-4435-b9fa-7f4787055ce9",
      "userName": "Bryan L (ABrL)",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK4l3tKcxPkIZ5Sh-wZItHReYzZtcfbkPVVFP6Ylxim=mo",
      "date": "2024-02-02T20:33:43.270Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=76d84347-c7ca-4435-b9fa-7f4787055ce9",
      "title": null,
      "text": "Great game but I'm only giving it 3 stars. I have no idea how the devs are not combatting all the scammers on here. They are rampant. It's really easy to change the way trades happen. Instead of allowing the other end to choose a sticker to trade ( this opens up scamming by giving the other person a totally different sticker), how about the one who engages or starts the trade create the terms. If the other end doesn't give a matching sticker according to the terms, then no trade. Easy!",
      "replyDate": "2024-02-05T12:20:32.235Z",
      "replyText": "Thanks for your feedback, Bryan. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 720,
      "criterias": []
    },
    {
      "id": "fde8b024-7e2d-41b5-bb40-97b1607d7394",
      "userName": "Amy Hilburn",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUORJu-_LaJQCbolz8wvrnOHUAMYmsX4eINzi1xv56K-Z0",
      "date": "2024-02-14T00:32:26.520Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=fde8b024-7e2d-41b5-bb40-97b1607d7394",
      "title": null,
      "text": "Fun game, no ads which is nice. But you don't get back what you give. I'm on level 100 now and get 10 dice per hour. One level now costs over $1B, but I only get 50 dice for completing a level. The spin wheel should have higher rewards the higher you get. I'll never complete the sticker challenge because I get new stickers every pack. Also the roll mechanics feel staged, I'll miss free parking every time if there's a prize, but if no prize, I'll land on it every time. Need better rewards.",
      "replyDate": null,
      "replyText": null,
      "version": "1.16.0",
      "thumbsUp": 454,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 3
        }
      ]
    },
    {
      "id": "e27b1b55-c5bc-4a63-adfe-20e459cd2ba0",
      "userName": "Maurisa Lopez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKIfjn8L9qi6KU3h-58zWxw56HE5VWWLWxzh5QJ6sgB=mo",
      "date": "2024-02-02T08:25:39.155Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=e27b1b55-c5bc-4a63-adfe-20e459cd2ba0",
      "title": null,
      "text": "I love this game. My friends and I are addicted, but Scopely, if I'm paying larger sums of money to build more boards I should be receiving larger sums of dice for that completion. It only makes sense. A standard 50 per board is useless. Please adjust this! Also, I've opened 4 blue packs in the last 20 minutes alone and got all duplicates. Make new stickers just a tiny bit easier to come by please!",
      "replyDate": "2024-02-02T12:08:11.760Z",
      "replyText": "Hi Maurisa Lopez! Thanks for the suggestions. We understand your frustrations with reward results being RNG-based. The results will always be random and cannot be influenced in any way. We'll be sharing your feedback with the team for further consideration. Kindly stay tuned for now!",
      "version": "1.16.0",
      "thumbsUp": 245,
      "criterias": []
    },
    {
      "id": "e4d77806-cba9-4594-8542-a0021decd8b1",
      "userName": "Noemi Ramirez",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKx_otkS5Bwo3eHsgF9XAr6xYO4ln7CwGcXX2ebXalU=mo",
      "date": "2024-02-05T06:37:47.449Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=e4d77806-cba9-4594-8542-a0021decd8b1",
      "title": null,
      "text": "Complete waste of time and money, when you first start playing it's fun and all but once you get far enough you hit a standstill and you will have to spend money if you want to progress and even the it's not guaranteed to help. I used to enjoy this game but the updates have made it less enjoyable. Stickers are hard to come by if you need 4 star or higher, there was sticker boom that helped out but now it's just a random selection of players who get it. And rewards have gotten worse too",
      "replyDate": "2024-02-05T08:06:26.427Z",
      "replyText": "Hello Noemi! Your feedback is much appreciated. Rest assured that we are working hard to develop the game and give a better gaming experience for everyone. If you have other concerns, please email us at monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.16.0",
      "thumbsUp": 918,
      "criterias": []
    },
    {
      "id": "e69224ee-0da2-4a55-9243-7af9c6a4964d",
      "userName": "Jasen Swett",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIaXNHMHLqClcWvV3kqmgAY0P3y8BXFX94FYKxrOtYm=mo",
      "date": "2024-02-13T19:10:16.442Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=e69224ee-0da2-4a55-9243-7af9c6a4964d",
      "title": null,
      "text": "You guys make it impossible to complete the partner events. And the algorithm for refilling shields should be better. When I have for example 700 dice I shouldnt have to waste almost all of those just to refill. The same with the stickers . All they are are repeat after repeat... Never able to finish the whole album Please make this game more enjoyable.",
      "replyDate": "2024-02-14T04:59:01.621Z",
      "replyText": "Hello Jasen! Your feedback and suggestions are much appreciated. This has been noted for future game enhancements. If you have any further questions or concerns about the game, please contact us via monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.17.0",
      "thumbsUp": 28,
      "criterias": []
    },
    {
      "id": "ab7230bd-9da5-4fd0-a5c4-bfc0e9de04a4",
      "userName": "Destiny Mynx",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXlfaZAEnkLmkaRAWegm7jViMolMTFRZAGbigoBar2ebwc",
      "date": "2024-02-21T04:32:08.625Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ab7230bd-9da5-4fd0-a5c4-bfc0e9de04a4",
      "title": null,
      "text": "Too many pop ups! I love this game. could easily be a 5 star game. but you have too many pop ups. when you open game. when your low on dice. plus the deals take up most of screen. we get it. you want our money. Give me a option to pay to turn off ads and pop ups and I will do that. cause for now this game sucks. hate having to close everything out so often.",
      "replyDate": "2024-02-21T06:53:57.731Z",
      "replyText": "Hi Destiny! We appreciate your time in sharing your thoughts with us about getting multiple pop-up offers. It's important to note that you're not under any obligation to make purchases, as these are just prompts. Your feedback is valuable to us, and we'll carefully consider it to enhance the overall experience.",
      "version": "1.17.0",
      "thumbsUp": 0,
      "criterias": [
        {
          "criteria": "vaf_games_dimensional_plane_3d_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        }
      ]
    },
    {
      "id": "eaab8458-f974-44ea-883d-ede0494149dc",
      "userName": "Melissa Vera",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWWoGYihxd7H3yKLTylBXTCDK1uxcGt7g6UyeUI7u5Aq42g",
      "date": "2024-02-05T09:55:55.980Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=eaab8458-f974-44ea-883d-ede0494149dc",
      "title": null,
      "text": "I like the app. BUT when I go to jail the rolls can't be random. Haven't rolled doubles over the last 20+times. Then at least 3 ads w u run out of die. PLAYERS,shut downs help u get the M's. Also wish u could interact w the scenes where u build. Ie go inside the bldgs.etc Also, how does the game decide shut down/heist when u land on a railroad? Lastly, why do u only get 50 die for board comp, even at board 150+. It needs to increase as does the #of die in a shorter time frame.",
      "replyDate": "2024-02-05T11:39:06.473Z",
      "replyText": "Hi Melissa, thank you for your inquiry about the game. Please reach out to us from inside the game and will be able to investigate it further. We're sorry about any inconvenience and looking forward to hearing more from you to assist you better.",
      "version": "1.16.0",
      "thumbsUp": 45,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        }
      ]
    },
    {
      "id": "c82f7576-70e7-44f7-baa3-e670878cfb06",
      "userName": "SS PUNISHER Buentello",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXeefFhGTYt8htmCKU0UhuE9rbWx9ILK1OmlYu3_epzX2Q",
      "date": "2024-02-14T18:44:10.449Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=c82f7576-70e7-44f7-baa3-e670878cfb06",
      "title": null,
      "text": "The game is fun, and at first, you will get plenty of dice to get you hooked. But then, in order to play and actually have fun. You have to buy dice, I have several times, but it costs way too high. Playing at high levels is pointless if you're not buying dice. You can't do much or win dice with the small amounts given to you to play. Well, the game has dropped even another star. This game is rigged in order to get you to spend money yo really get the top benefits of the game.",
      "replyDate": "2023-12-01T12:26:34.461Z",
      "replyText": "Thank you for sharing your thoughts with us, dear player. We're doing our best to keep a good gameplay experience so our players get to enjoy the game equally whether spending money on game offers or not. Your feedbacks are collected and we'll keep on looking for opportunities to further improve the game. Kindly look forward to it.",
      "version": "1.17.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "90fef440-cb64-462b-909f-c4af5b1acc92",
      "userName": "Chris Ware",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXKlobgNaWN1C0SZ0VHxTRB95uD-_hgyobbc-Y-4iYuy7c",
      "date": "2024-01-27T16:50:28.426Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=90fef440-cb64-462b-909f-c4af5b1acc92",
      "title": null,
      "text": "At the lower levels the game is very enjoyable. As the game progresses it goes from challenging to impossible without spending money (which I refuse to do). The targets to win rewards become harder and harder to reach but the tokens needed to reach the goals don't increase proportionally. No way to achieve a target in 48 hours when you only earn 10 dice per hour and are capped at 100 dice capacity. Collecting stickers becomes a dead end when you stop getting any new ones to complete a page",
      "replyDate": "2024-01-30T08:48:21.830Z",
      "replyText": "Thank you for sharing your thoughts with us, Chris. Please know that we always look for ways to give our players a good gameplay experience, so that everything inside the game can be obtained or achieved, no matter if you are a paying player or not. We hear you and we'll keep on looking for opportunities to improve our game further.",
      "version": "1.16.0",
      "thumbsUp": 269,
      "criterias": [
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 3
        }
      ]
    },
    {
      "id": "b4248c05-a5f2-4797-bfc6-793fdffffef0",
      "userName": "rebecca “MzBlaze” barnwell",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVTtXzeuH-L_Y6XzQg0DPbwPf5vVumDVmUbmVli06TDHjU",
      "date": "2024-02-07T21:29:17.985Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=b4248c05-a5f2-4797-bfc6-793fdffffef0",
      "title": null,
      "text": "I had to come back and take away a few stars because every time I get to level 65 my game resets and I have to start all the way over. I keep losing money this way. I'm thinking of uninstalling the game at this point. I feel like it's a waste of time and money!! I'm also tired of getting the same stickers every day. Even when I buy them, they're all the same!! 🙄 Please fix these issues. Rerating: really good game, need more dice per minutes, really good graphics",
      "replyDate": "2023-08-04T14:31:02.390Z",
      "replyText": "Hi rebecca “MzBlaze” barnwell! Apologies for the inconvenience caused by the issue you've encountered. Please contact our customer service team at monopoly-go-support@scopely.com with more details of the issue so that we can investigate and assist you more effectively. Looking forward to hearing from you.",
      "version": "1.16.0",
      "thumbsUp": 1557,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "3d5eab80-86dd-4f9a-bc19-e55e0cfcf715",
      "userName": "shane young",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVe6IQlMpqguzhuwOQAfme4YGmh8GtOyPe18fhS6Jn-yA",
      "date": "2024-02-14T23:22:17.257Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=3d5eab80-86dd-4f9a-bc19-e55e0cfcf715",
      "title": null,
      "text": "This game was fun, until I got to a higher level and now it is impossible to finish partner events compete in the tournament. And I'm not spending any more money it's not worth. I won't even finish the sticker album this time. This game is pay to win or you will just barely get the minimum. Thinking about unistalling soo. It is a fun game to kill time play is smooth and the side events are nice. But since I have to constantly buy dice I won't be playing much.",
      "replyDate": "2024-02-15T10:20:58.796Z",
      "replyText": "Thanks for your feedback, Shane. We appreciate you sending us this concern regarding the game and apologize if this affects your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 5,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 2
        }
      ]
    },
    {
      "id": "fcf84aed-70d2-44b3-8133-9ee08fd16a06",
      "userName": "Kevin Ragan",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJR3ZBC4dkFMAR6i1w_OWpDIFO2nKYqfMpWVpfjDXa_=mo",
      "date": "2024-02-03T11:31:02.722Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=fcf84aed-70d2-44b3-8133-9ee08fd16a06",
      "title": null,
      "text": "The game is rigged for you to lose. Travel around the board only to magically miss what you need to land on for the various events by one tile every time. Each time an even is made of too many people complete it the next time around the developers either increase what you need to finish by an impossible amount or make the resources needed more scarce. There's no increase of rewards with net worth (level), only excessively high costs to keep going. All in, the game is a scam to get you to spend $",
      "replyDate": "2024-02-03T13:51:34.289Z",
      "replyText": "Hi Kevin! Thank you for sharing your thoughts with us. We are doing our best to keep a good gameplay experience, so that everything inside the game can be obtained or achieved, no matter if you are a paying player or not. Of course, we hear you, and we will be looking for opportunities to improve our game further.",
      "version": "1.16.0",
      "thumbsUp": 810,
      "criterias": []
    },
    {
      "id": "90c9308b-85c6-49f7-ba2d-ab3a54c9a20c",
      "userName": "Irwin A - Top 10% Google Reviewer",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUFdDqr86kRtQkjpslTpDYKg_xHv_i8-oj6SV-RoXrEJgnD",
      "date": "2024-02-01T05:44:04.744Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=90c9308b-85c6-49f7-ba2d-ab3a54c9a20c",
      "title": null,
      "text": "I've playing this daily for a couple months now. It is very repetitive and it gets old. They do have weekly events that make it a little more exciting but then you have teammates that end up not participating which sucks. Another downside is players that like to shutdown your properties but they never have properties for you to attack back. Also for the last 2 or 3 weeks I'm not getting the final price on the quick wins. I've tried since Sunday to get assistance on this and no help! 👎",
      "replyDate": "2024-02-01T05:12:48.394Z",
      "replyText": "Thanks for your feedback, Irwin. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 360,
      "criterias": [
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        }
      ]
    },
    {
      "id": "2f7ec515-83b6-41a9-bf44-ad0d19c24456",
      "userName": "Penny Baldridge",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKM5JvK2xGqbp4JYA0e7bWsZjZ0zXv_Z8HLj5bilfj0=mo",
      "date": "2024-02-04T10:53:45.138Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=2f7ec515-83b6-41a9-bf44-ad0d19c24456",
      "title": null,
      "text": "I love playing! I am curious as to how far it can go though or if you just eventually start over fresh with a whole new monopoly map once you finish the original! Idk! There is an issue with people spamming other people with back to back attacks without the option to block them. It also seems as if coming along the items you need for the side games is getting ridiculously hard. Other than that I love this game. Good Job guys!",
      "replyDate": null,
      "replyText": null,
      "version": "1.16.0",
      "thumbsUp": 821,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_dice",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 3
        }
      ]
    },
    {
      "id": "ddf26650-15a6-4f76-8957-ff407193fe78",
      "userName": "Andres navarro",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKKTE8zQwHrZ1H4TR9q0AR6tMkgs6F-uzdSIEaM-dwZ=mo",
      "date": "2024-01-31T17:10:27.565Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ddf26650-15a6-4f76-8957-ff407193fe78",
      "title": null,
      "text": "Unfair This is a great game very challenging but it is unfair. Twice, have I been close to winning grant price of the daily quickly Win. Took me over 7 days to complete Every daily quick win challenges. For me to be to win the big price. But the app reset the quick win board and had to start all over again. At first I thought I was losing it. But when it happened again, I knew it wasn't me. This app should be fair. But overall good game",
      "replyDate": "2024-02-01T04:32:19.597Z",
      "replyText": "Thanks for your feedback, Andres. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 162,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_games_genre_board",
          "rating": 1
        }
      ]
    },
    {
      "id": "0eb6dbed-d326-4df2-90f2-62b92e2669c4",
      "userName": "Johnathan Sells",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJycNLPJbD-FN0NRh4oB99YmrBpfzNx03ErqebdO9B3=mo",
      "date": "2024-02-18T17:22:04.504Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=0eb6dbed-d326-4df2-90f2-62b92e2669c4",
      "title": null,
      "text": "This game was awesome. Over the past few months it has become clear you don't matter. They only want your money. It is impossible to gain dice and stock them up. The stickers are now a joke. Rewards have been reduced and are extremely difficult to obtain. Each level for an event has been increased to make awards more difficult to earn. The recent update removes random chance of where you land on the board. All rolls are predetermined!",
      "replyDate": "2024-02-19T07:12:54.291Z",
      "replyText": "Hi Johnathan! Thank you for sharing your thoughts with us. We understand how this affects your game experience. We are doing our best to keep a good gameplay experience so that everything inside the game can be achieved, whether you are a paying player or not. Of course, we hear you and will look for opportunities to improve our game further.",
      "version": "1.17.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "901056fa-d17a-4914-a160-5cb644c2da96",
      "userName": "Brandy Slusher",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWslOE8-FevPpPT14sSMvjb3JLPsK_GZMYx5dqcWR2GqWE",
      "date": "2024-01-29T03:49:43.820Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=901056fa-d17a-4914-a160-5cb644c2da96",
      "title": null,
      "text": "I have fun playing this game, but there needs to either be a way for people to attack you once a day or a way to report those that take advantage of switching people when doing a shut down. I have found myself multiple times almost done with a board to come back and see that all of my buildings are destroyed completely by the same person, repeatedly. It's frustrating and a turndown to the game when all that time and effort is for nothing.",
      "replyDate": "2024-02-07T12:18:43.728Z",
      "replyText": "Thanks for your feedback, Brandy. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 214,
      "criterias": []
    },
    {
      "id": "7c5e8244-73e4-48d0-8035-0ce1f7267fd9",
      "userName": "Sandi Marie",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVXlz52SWR1TjA6vjAdEZqEJNoy1utVxIRtNrg9DIwFf3s",
      "date": "2024-01-31T15:04:25.774Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=7c5e8244-73e4-48d0-8035-0ce1f7267fd9",
      "title": null,
      "text": "Addictive game! Once you figure out the Ins and outs (there's a lot of pop up help), you can't stop rolling the dice, building your boards, knocking down opponents buildings, and find bank heists...it's really a lot of fun to waste a bit of time and not think about anything else. There's no ads so far, and, I've just completed my first board! Lot of fun 😁",
      "replyDate": "2024-01-31T07:53:49.612Z",
      "replyText": "Hello Sandi! Your comment is very appreciated, and we are delighted that you are enjoying the game. We'll continue to look for ways to further improve the game. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.16.0",
      "thumbsUp": 150,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        }
      ]
    },
    {
      "id": "1735d103-5fd1-4173-bd5b-774e18e9d1f0",
      "userName": "Angelica Francis",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocITC29NgEj3Ku8riZiaUe8FJ3woAryydOcmgdyUhIgo=mo",
      "date": "2024-02-14T04:03:59.669Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=1735d103-5fd1-4173-bd5b-774e18e9d1f0",
      "title": null,
      "text": "Can't log in to my account via Facebook. Continually getting an error message and can't play. UPDATE: the email I got from Scopely in their reply, they tell you to go in to the app and contact support that way. I have now tried twice at two different times and have not received a response after waiting an hour or more. I have given up hope on this game and will be uninstalling for good.",
      "replyDate": "2024-02-13T08:42:48.266Z",
      "replyText": "Hello Angelica Francis! We are sorry to hear that you're experiencing this issue. Please contact our support team at monopoly-go-support@scopely.com so we can better assist you.",
      "version": "1.17.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "f52516fe-7361-4802-8c94-012c99da59bc",
      "userName": "Pam Minor",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLeHQ0aszeplkdMhs95E2eVy9a_lkMzK97uGvWb6LE0=mo",
      "date": "2024-02-01T23:19:34.255Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=f52516fe-7361-4802-8c94-012c99da59bc",
      "title": null,
      "text": "Love this frustrating game, but there needs to be some changes in my opinion. Please remove the 5 & 10 minute dice boosters. Whenever they come up I never have enough dice to make it beneficial for me. Also need to change the number of sends per day, and when you get to the higher levels dice need to generate faster and higher amounts. Thank you for listening.",
      "replyDate": "2024-02-08T13:38:17.504Z",
      "replyText": "Hello Pam! Thank you for your comments. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.16.0",
      "thumbsUp": 84,
      "criterias": []
    },
    {
      "id": "98c0b848-1086-494c-b2f0-e7df5fe455ab",
      "userName": "david logan",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX85v9Rtusc0Gv9KzizpTv3GSC55e-fFJZEgSyMxro8WQ",
      "date": "2024-02-13T21:26:19.210Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=98c0b848-1086-494c-b2f0-e7df5fe455ab",
      "title": null,
      "text": "Ok so when I first started this game. I really liked it. But then I noticed all the little side things like the partner builds , and the other game at top of screen . It don't matter how many hearts or hammers or dice you get . The count meter barely moves so it almost impossible to complete and win . I just spent 24 hours playing and still don't have half the points to reach 5000 to win 2000 rolls cause the meter barely moves. Same with the albums. Yall should lighten up on that",
      "replyDate": "2024-02-14T00:31:56.455Z",
      "replyText": "Hello David! Thank you for your feedback. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.16.0",
      "thumbsUp": 16,
      "criterias": []
    },
    {
      "id": "7ada02cc-0ad8-4cf2-a06f-41d0c96fe8fe",
      "userName": "Bruce “Magusat999” B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV-W4oPyzconadoCNJMHTP_CkYttpnpSmk-57jad6SpPw5O",
      "date": "2024-02-13T13:18:19.880Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=7ada02cc-0ad8-4cf2-a06f-41d0c96fe8fe",
      "title": null,
      "text": "Game is fun, but it does get brutal as you progress. You cant play as much as you want, unless you invest cash in it, though! It begins to give you less, and start landing you on those money stealing squares a LOT after awhile. For clarity - it will force you to quit by giving you nothing for many rolls if you keep playing. Suddenly no more prizes, no dice, no nothing - just wastes the rest of your rolls and it feels designed that way because all my sessions, every day, end the same boring way.",
      "replyDate": "2024-02-12T07:10:48.993Z",
      "replyText": "Hi there Bruce “Magusat999” B. We appreciate you taking the time to share your thoughts with us on how we can better improve your gameplay experience. Rest assured that this will be shared with the team for further consideration so please kindly stay tuned for now.",
      "version": "1.17.0",
      "thumbsUp": 5,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "8743334d-7e67-4434-a96b-ad92712d4e37",
      "userName": "Kashti Haynes",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLRhiSO3mQJwTF_h9UTX1xhhjXqlWMq33Gve7-lZhe1=mo",
      "date": "2024-02-07T15:19:31.908Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=8743334d-7e67-4434-a96b-ad92712d4e37",
      "title": null,
      "text": "Here are a few suggestions. There should be more dice given when completing a landmark. We spend a lot of dice completing the landmarks to only receive bucks and 50 dice. Next, there should be other ways to get new tickets besides the Facebook group, too many scammers are popping up. Overall, I really do enjoy playing. It is very addictive, and it keeps you interacting with others. Thanks for creating this game.",
      "replyDate": "2023-11-18T06:09:53.755Z",
      "replyText": "Hi Kashti! Apologies for the freezing issue that you've encountered. Most performance-related issues can be resolved with some basic troubleshooting. If you need further assistance, please contact our support team at monopoly-go-support@scopely.com so that we can better assist you.",
      "version": "1.16.0",
      "thumbsUp": 66,
      "criterias": [
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v2",
          "rating": 2
        }
      ]
    },
    {
      "id": "7e625b27-9d16-43e0-ba4d-4be0b9e4b743",
      "userName": "Chip Veleos",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV_yKW6Hh2qej0rAAjTqA0SvBeSmaO8vWPdCinDzXvKp2U",
      "date": "2024-02-21T15:55:28.394Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=7e625b27-9d16-43e0-ba4d-4be0b9e4b743",
      "title": null,
      "text": "Fun game that passes time, most annoying part is EVERY time I'm out of dice it gives me a pop-up to buy more. No. If I want more dice, I'll go to shop to buy some, I don't need a pop-up each time. Also, maybe it's just cuz they started some new deals, but I shouldn't have 5+ pop-up deals when I first open the app...1-2 okay, 3 is annoying, 4+ IS NOT OKAY. Other than the pop-ups, pretty fun game 4/5",
      "replyDate": "2024-02-22T03:45:02.822Z",
      "replyText": "Hello Chip! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 0,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v2",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 2
        }
      ]
    },
    {
      "id": "7de0a02c-7187-498d-80f7-9787a2b15ef1",
      "userName": "Klint Wasson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXZ5YNj0ga9wEiwqbtfPYQsGuaJgkM_rwb_bquNdZ1GfLg",
      "date": "2024-02-04T13:08:58.683Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=7de0a02c-7187-498d-80f7-9787a2b15ef1",
      "title": null,
      "text": "This game is addictive! I love playing. The drawbacks are the pay to play mechanics of it. The meager quantity of dice that's given isn't very useful. The give and take ratio is extremely unbalanced. Collecting and trading stickers, as well as the occasional changing mini-games, keep the game interesting. The prices are very expensive to buy more dice, and the \"bundles\" could be better for the amount of money being paid.",
      "replyDate": "2024-02-05T12:07:14.221Z",
      "replyText": "Hello Klint! Your feedback is much appreciated. Rest assured that we are working hard to develop the game and give a better gaming experience for everyone. If you have other concerns, please email us at monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.16.0",
      "thumbsUp": 590,
      "criterias": []
    },
    {
      "id": "ac3f07d3-88a8-4dbb-b19b-687c1ffe2f3c",
      "userName": "James G",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUGrgaroAQs3BOxbBtd9EPUp2ufq8rcD6C9RyFyEx9OpM5Z",
      "date": "2024-02-04T19:26:09.927Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ac3f07d3-88a8-4dbb-b19b-687c1ffe2f3c",
      "title": null,
      "text": "It's an interesting game, but the number of in game purchase window popups that constantly appear....out of control. I've also noticed a few friends have an almost gambling like addiction to the game, dumping hundreds and hundreds of real dollars into this game in an attempt to...win? There is no end game to this app the levels are all identical, save the scaling mechanism, which is pretty clever from a business perspective.",
      "replyDate": "2024-02-05T08:21:59.721Z",
      "replyText": "Hi there James! We appreciate your time in sharing your thoughts with us about getting multiple pop-up offers while playing. Rest assured that this will be forwarded to the team for further consideration so please stay tuned for now. Feel free to contact us for any in-game issues, we'll be happy to help.",
      "version": "1.16.0",
      "thumbsUp": 285,
      "criterias": [
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 3
        }
      ]
    },
    {
      "id": "b2b276b7-4758-4c6b-a185-4516b9453879",
      "userName": "Laurie Swank",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjW9P6Yzs8WTxAiPSMNrEsuMsC4PCBL7FYRrKPqszpmi5tBH",
      "date": "2024-02-13T20:06:45.313Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=b2b276b7-4758-4c6b-a185-4516b9453879",
      "title": null,
      "text": "Re-edit.. Today I got on the app to do my quick wins. I had a hard time landing on any tiles that counted towards main event or side bar, let alone RRs. You cannot advance, build, gain dice, etc. without landing on those tiles. Your update to \"patch\" users who play on apm to roll at a higher multiplier to have a plethora of dice and stickers has done every single player wrong.!! We had a hard time before keeping dice and getting stickers. Now it's virtually impossible. Do Better.!",
      "replyDate": "2024-03-04T12:15:29.825Z",
      "replyText": "Hi Laurie Swank! Thank you for sharing your thoughts about the game which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 23,
      "criterias": []
    },
    {
      "id": "f5d38821-7bf4-404a-8fa0-dc35c58472f3",
      "userName": "Mo Jo",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU9dOAxh_eBsTtWLSEw50erIWhUxJGThUSrS01AytwlNw",
      "date": "2024-02-05T15:16:13.810Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=f5d38821-7bf4-404a-8fa0-dc35c58472f3",
      "title": null,
      "text": "Forced update froze my entire game. Couldn't access drop down menu to contact CS. Lost all my progress and had to delete the app completely. I have no idea what happened. I lost all my stickers, all my purchases, all my dice. I will be contacting my bank and customer service hasn't even returned a message to my new account, I had to start to even get a hold of them. They haven't responded. I refuse to go through all the beginner stuff and start over. That takes way too long.",
      "replyDate": "2024-02-06T12:38:02.821Z",
      "replyText": "Hello Mo Jo! We are so sorry that your concern is taking longer to resolve. Rest assured that it will be addressed soon!",
      "version": "1.16.0",
      "thumbsUp": 85,
      "criterias": []
    },
    {
      "id": "0918f130-3f1d-46e5-a821-b2b031d1a010",
      "userName": "Brittany Woolard",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVEam4q2ZUBrrdZNCONTAN5z3UklC028BzOuCe6nv9AWw4",
      "date": "2024-02-17T21:15:27.878Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=0918f130-3f1d-46e5-a821-b2b031d1a010",
      "title": null,
      "text": "Overall a great, fun game with daily challenges and play! Only downside is how little dice you get for the packs, and rewards not worth it at all. I can see many people stopping after reaching lvls 150-200 because of the lack of dice to play as 90-100 dice doesn't give you much to then take weeks to complete one board. Doing 1* per roll will eventually give you the money you need but it will never win you tournaments, and events.",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 1
        },
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "76f30310-85f5-4758-9436-1d5541b711b1",
      "userName": "Barbara Barth",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJdSiGq1SzJ_ZxRgTjo1YzSfkO1SDsCo1B9P7hVXL8N=mo",
      "date": "2024-02-03T21:15:18.516Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=76f30310-85f5-4758-9436-1d5541b711b1",
      "title": null,
      "text": "I would have given it 5 stars in the beginning but now I'm ready to Uninstalle the game I like playing it but it won't let you land on railroad to try and get prizes it won't let you land on the places it mentions on other ways to get prizes but as soon as they change it to new ones you land on the others back to back. In the beginning of the game they let you level up really quickly allow you to keep landing on the railroad to earn prizes along with the other markers for prizes. No dice",
      "replyDate": "2024-02-05T12:02:32.352Z",
      "replyText": "Thanks for your feedback, Barbara. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 97,
      "criterias": []
    },
    {
      "id": "42deb8f7-9725-490c-86d8-ddf881ad75e8",
      "userName": "Jamie Fritz",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjX1bQ5n9jADVnXz4M6stQliQ6QhisVe-wDXwwreN41FDCw",
      "date": "2024-01-26T18:44:24.479Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=42deb8f7-9725-490c-86d8-ddf881ad75e8",
      "title": null,
      "text": "I'm so tired of this game. It was fun at first when we could complete boards easily, and get random stickers to complete set. Now we only get 5 dice for some rewards, hardly any new stickers to complete sets. Everyone on fb begging for certain stickers. It's ridiculous. Wish we could get more than just 50 dice for completing a level considering how much dice we use to complete it. It's just not fun anymore. We need more options for getting dice and stickers that we need.",
      "replyDate": "2024-01-28T05:54:07.789Z",
      "replyText": "Thanks for your feedback, Jamie. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 227,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 3
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 3
        }
      ]
    },
    {
      "id": "20911973-be9e-407c-b401-4eaa6a73f36b",
      "userName": "Elizabeth Stanton",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJL58gZvmXUAGhqX8h4Kv6K4v3cfMmxkXAp55xMScdK=mo",
      "date": "2024-01-29T16:33:18.368Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=20911973-be9e-407c-b401-4eaa6a73f36b",
      "title": null,
      "text": "This game is a lot of fun, but I do have complaints. I understand the farther you go, the harder it's going to be to get stickers, dice, money, etc, but this is just nuts. When you land on buildings, there is more blocking. When you land on moneyheist, there are more small heists than large. Plus everything costs more so you use more dice. There needs to be more ways to offer dice, stickers, money. Also the same person attacked my building 7 times in 20 minutes, that's not right.",
      "replyDate": "2024-01-30T12:28:38.700Z",
      "replyText": "Thanks for your feedback, Elizabeth. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. Don't hesitate to reach out in-game to our Customer Support Team in the meantime.",
      "version": "1.16.0",
      "thumbsUp": 86,
      "criterias": []
    },
    {
      "id": "3b220994-c58a-448e-869b-da7b6cf8a403",
      "userName": "Telisa Smith",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJx_hgVYZ-mYdVSFZ36O_d_7f6pMDQDluVPfMh7dOga=mo",
      "date": "2024-02-13T20:03:38.654Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=3b220994-c58a-448e-869b-da7b6cf8a403",
      "title": null,
      "text": "Do not play this game! You will regret the amount of money you spend just to keep up with everyone else! Not to mention that the game is rigged so even when your about to win something it glitches and then makes you lose. The rewards for tournaments and events are becoming less for twice the effort now. It's a shame that a game that was fun is now being changed in order for people to spend blindly for stickers they can't even hold on to! I don't think I want to play anything Monopoly ever again!",
      "replyDate": "2024-03-04T12:16:21.152Z",
      "replyText": "Hi Telisa Smith! Thank you for sharing your thoughts about the game. I want to assure you that Monopoly GO! is designed with fairness in mind. The game utilizes random number generation, ensuring a balanced and unpredictable experience for all players. We are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 4,
      "criterias": []
    },
    {
      "id": "1743ce17-dc72-49f0-bdba-776b482390a8",
      "userName": "Kari Fredrickson",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUUP6U-sm920Jb4Nf8J5GJXqKeUqj6imx09qGcwweyheQ",
      "date": "2024-02-14T19:30:28.986Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=1743ce17-dc72-49f0-bdba-776b482390a8",
      "title": null,
      "text": "I have been a loyal player for months. In the beginning I really enjoyed it. Scopely has made this game incredibly difficult to succeed. The partner events have become impossible to complete! I have tried trading and even buying dice. It makes no difference. It's so disappointing. This app is awful. If you have unlimited money to spend on a game, this is for you. All of the cheating and airplane mode scams have ruined this game for everyone.",
      "replyDate": "2024-02-15T04:44:35.612Z",
      "replyText": "Hello Kari! Thank you for sharing your thoughts about the game. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "68b21e6e-d00e-467a-98bb-d9c1530c6164",
      "userName": "Blade Zulu",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWFPx6jqIvDhlpqZ5e9_yWUrlEDeF7JGMuvH1D3OTomhQ",
      "date": "2024-02-05T08:18:13.389Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=68b21e6e-d00e-467a-98bb-d9c1530c6164",
      "title": null,
      "text": "The game is graphically a beautiful and enjoyable game to play. The problem with the game is the support for the programming/technical errors in the functioning of the game. The support refuses to come to a consensus on issues related to its game and will provide \"canned\" responses instead of actual action to correct errors. Strongly recommend not spending money in this game and use the free resources it provides, if you or your child chooses to play. Perfect example of canned responses.",
      "replyDate": "2024-02-05T06:42:58.994Z",
      "replyText": "Hi Blade Zulu! Thank you for sharing your thoughts with us. We are doing our best to keep a good gameplay experience, so that everything inside the game can be obtained or achieved, no matter if you are a paying player or not. Of course, we hear you, and we will be looking for opportunities to improve our game further.",
      "version": "1.16.0",
      "thumbsUp": 35,
      "criterias": [
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 3
        }
      ]
    },
    {
      "id": "621b4b1f-9ad4-4836-addd-8cd1fefa796b",
      "userName": "Gina Ford",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWl6yq-Ug6qRgGn9C6H2r0Wlx1U_Qf6eJqtXMOZyNdD-88",
      "date": "2024-02-13T18:41:29.675Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=621b4b1f-9ad4-4836-addd-8cd1fefa796b",
      "title": null,
      "text": "Everything is rigged. One day during tournaments you will hit Railroads but when you really need to hit, it avoids them like a plague. Same with other spots that are needed to collect points for tournaments. The spins for the partner event is rigged too. I noticed it will slow down, then speed up past the gold spots. Or even slow down, make it look like it is about to stop on a good spot them EASE slow enough to go to the worse spot possible. Don't get me started on how rigged Community Chest is",
      "replyDate": "2024-03-04T12:44:55.900Z",
      "replyText": "Hi Gina Ford! Thank you for sharing your thoughts about the game. I want to assure you that Monopoly GO! is designed with fairness in mind. The game utilizes random number generation, ensuring a balanced and unpredictable experience for all players. This randomness contributes to the exciting and dynamic nature of the game.",
      "version": "1.17.0",
      "thumbsUp": 5,
      "criterias": []
    },
    {
      "id": "5804e622-19f0-4a61-875f-76a53ea6d40b",
      "userName": "Fran L",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKNNQ9jt0cJAQUrE91u6CUBOqYSt3oLvs2dfDjyoc6o=mo",
      "date": "2024-02-10T22:50:21.822Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=5804e622-19f0-4a61-875f-76a53ea6d40b",
      "title": null,
      "text": "I have contacted customer service several times with concerns from missing stickers to the most recent incident of being rewarded for the partner event and answering my phone, when returning back to the app, apparently there was a sticker boom and I only had 1 minute left. I didn't even see the rewards. Tried to contact customer service yet again and no response to the previous or the new post. Frustrating to say the least!",
      "replyDate": "2024-02-12T08:50:25.310Z",
      "replyText": "Hi there Fran! I'm sorry you are having some issues with your account. We also apologize that your issue is taking longer than expected to be resolved. Please rest assured that your concern will be addressed, even if it takes a bit longer! Please bear with us - the Customer Support Team will get back to you as soon as possible.",
      "version": "1.16.0",
      "thumbsUp": 103,
      "criterias": [
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 3
        },
        {
          "criteria": "vaf_games_genre_dice",
          "rating": 1
        }
      ]
    },
    {
      "id": "f12541fc-0db4-4bfa-80f8-af5505d81aec",
      "userName": "N1nja Squ1r3l",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXksCen4Z5qqd3QqyWdzOGbuTYHUH6RDx58jfwyEDvIhw",
      "date": "2024-02-14T11:47:28.114Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=f12541fc-0db4-4bfa-80f8-af5505d81aec",
      "title": null,
      "text": "RNG Sucks. My wife and I have not been able to complete the last 3 partner events because the spin the wheel aspect only gives us the lowest amount possible. The last 2 albums (including the Xmas one) would rather give you 10 copies of a sticker before it gives you a new one, regardless of how much you play. Most of the players seem to be chinese bots. The only reason I keep playing is to help my kid with his. Also there seems to be a bias in the algorithm in favor of apple products.",
      "replyDate": "2024-02-17T06:24:37.169Z",
      "replyText": "Hello N1nja Squ1r3l! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 11,
      "criterias": []
    },
    {
      "id": "358ebfe5-eff1-4dab-91e2-2946e6cbbb46",
      "userName": "Steven McDaniel",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK1kNMicPOsZdP-oROOZZIuAmbi2tUQfywbh3a0hS2_=mo",
      "date": "2024-02-16T13:41:58.333Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=358ebfe5-eff1-4dab-91e2-2946e6cbbb46",
      "title": null,
      "text": "Besides the fact that the game is completely pay to win, it's loaded with cheaters and the support option is preloaded questions and a chatbot. I'm totally unable to get any assistance with my issue. The game is fun at first but then it becomes clear you're only going to get to play a few times a day unless you spend tons of money on microtransactons. Not to mention the stickers are the same way, you can't complete a set without spending.",
      "replyDate": "2024-03-07T10:10:59.574Z",
      "replyText": "Hi Steven McDaniel! Thank you for sharing your thoughts about the game which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 3,
      "criterias": []
    },
    {
      "id": "3c03cd65-5cc8-4fb7-b6b4-cb2af6ac4b57",
      "userName": "Dawn Matthews",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXEG2l53JExLNYCvvq2pJEit3HxcwAk7BEc-agtM1EQi5c",
      "date": "2024-02-14T22:51:41.834Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=3c03cd65-5cc8-4fb7-b6b4-cb2af6ac4b57",
      "title": null,
      "text": "The game used to be fun, but now it just sucks!! You can't get the stickers you need & the partner event has become impossible to complete. It's very annoying to play anymore. I will be deleting it & finding something else to play while passing the time. The Valentine Partner event just ended & I wasn't able to complete 1, let alone 4, partner events!! I play on 3 different boards, at 3 different levels, on each board & none of us were able to complete any of our cakes on this partner event!!",
      "replyDate": "2023-12-26T10:02:09.421Z",
      "replyText": "Hi, Dawn Matthews. We're sorry that you're unhappy with our mechanics related to earning stickers. Our team is always on the lookout for players feedbacks so we know what features in the game is needed to be improved and this is one of it. Please look forward to our improvements in the game. Thank you!",
      "version": "1.17.0",
      "thumbsUp": 5,
      "criterias": [
        {
          "criteria": "vaf_games_genre_simulation",
          "rating": 1
        },
        {
          "criteria": "vaf_games_subject_horse",
          "rating": 2
        },
        {
          "criteria": "vaf_games_feature_leaderboard",
          "rating": 1
        }
      ]
    },
    {
      "id": "96101dc5-c36c-4383-a3c7-2233f0bb24dd",
      "userName": "kayla crabs",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIX1lgjsauu-Pm8Grb42q6JKe5h5NtoHqkHMa93fNrC=mo",
      "date": "2024-02-13T23:29:19.781Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=96101dc5-c36c-4383-a3c7-2233f0bb24dd",
      "title": null,
      "text": "This game could be a lot better then what it's made to be, I cannot complete abulms do to so many duplicates instead of getting anything new, also the events are very hard to complete even when it's only 3 to4 days long or less. Even when you partner up and your parent refuses to help, you should be able to kick them out and change partners without them receiving any rewards they don't help out with! Definitely needs a change for the game to be better and not get boring so fast!",
      "replyDate": "2024-02-24T05:01:50.990Z",
      "replyText": "Hello Kayla! Your feedback and suggestions are much appreciated. This has been noted for future game enhancements. If you have any further questions or concerns about the game, please contact us via monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.17.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "9f2c74d2-791b-4c17-85ee-0a905c182744",
      "userName": "V",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIb1f9qfv4DhQrI0uG-OnfzOGcYHeztilFb26L5CJC0=mo",
      "date": "2024-02-02T15:10:42.161Z",
      "score": 5,
      "scoreText": "5",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=9f2c74d2-791b-4c17-85ee-0a905c182744",
      "title": null,
      "text": "(Previous review, READ 2ND ONE)I grew up playing Monopoly. I dig that little 20's/ 30's mogul. Lots of fun, and there are in-app purchases, but you can play for free, too! NEW REWIEW: I may quit. About a 3rd of the way through the last treasure hunt game, there was a glitch, I had to start over ( was playing as guest) and I moved up quickly because im a strategic player. Had a great time the last 2 days. Just went back in after eating, I'm missing about 100 dice! What's that about???😕😳",
      "replyDate": null,
      "replyText": null,
      "version": "1.16.0",
      "thumbsUp": 58,
      "criterias": [
        {
          "criteria": "vaf_games_single_player",
          "rating": 1
        }
      ]
    },
    {
      "id": "330682ca-d308-4ae1-b2e3-8b1c69d2eb7b",
      "userName": "Amber Hansen",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUJtWPPl0EytMbRXtwL_z4x0f7XAbAabLxGawYQzRLRPA",
      "date": "2024-02-15T08:46:33.291Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=330682ca-d308-4ae1-b2e3-8b1c69d2eb7b",
      "title": null,
      "text": "At the end of the event for valentines day with the cakes with fellow players I had all 4 completed but didn't collect the last prize in time when the event ended BUT it was completed but still wasnt accepted. I've spent money on this game to complete challenges. I deserve my full rewards I feel. I should have been able to accept the completed reward when the event ended before them telling me it was just ended and getting the full reward. I will change my review if and when this can be fixed.",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 2,
      "criterias": [
        {
          "criteria": "vaf_games_genre_board",
          "rating": 1
        },
        {
          "criteria": "vaf_games_subject_rally_racing",
          "rating": 2
        },
        {
          "criteria": "vaf_never_display_negative_ads_impact",
          "rating": 3
        }
      ]
    },
    {
      "id": "b8e22431-eda3-472a-b716-315ff0f370d4",
      "userName": "Mary Jo Martin",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLKkX8p72H3igqrv34uB7LvPk9zZdV7A4dGLPCcEzeB=mo",
      "date": "2024-02-15T15:57:54.573Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=b8e22431-eda3-472a-b716-315ff0f370d4",
      "title": null,
      "text": "Was fun. Not any longer. They've gotten greedy and ruined a great concept. Going weeks without a golden blitz, way too hard to get needed 5 star cards, making partner events too difficult to complete without spending money. 4 and 5 star cards disappearing from inventory, and customer support does nothing to rectify the glitch. Dice rolls don't match what you move on the board. Ridiculous.",
      "replyDate": "2024-02-16T05:09:36.761Z",
      "replyText": "Thanks for your feedback, Mary Jo. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.17.0",
      "thumbsUp": 2,
      "criterias": []
    },
    {
      "id": "ef4e3ae9-56a6-405c-ba91-5b5088b3066c",
      "userName": "Dan B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXapwnOQEyVxiGq-o57eSfJSDeuV5WSqfku5Qrp0OCvx10",
      "date": "2024-02-17T13:28:30.700Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ef4e3ae9-56a6-405c-ba91-5b5088b3066c",
      "title": null,
      "text": "This game is nothing more than a slot machine. All you do for the most part is tap a button. No skill involved and very little if any strategy is needed. It does not scale well as you level up and clearly has luck multipliers in the back end to get you addicted to playing and attempting to manipulate you into buying dice.",
      "replyDate": "2024-03-07T13:36:16.281Z",
      "replyText": "Hi Dan B! Thank you for sharing your thoughts about the gameplay which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 2,
      "criterias": [
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "5e10689d-6e34-4fd9-8114-5e0ea063b647",
      "userName": "Nick Sellers",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJRKLM-hazZX-uZijHypL1LqR3DOAA7HrBoXEOqwwAF=mo",
      "date": "2024-02-06T05:25:15.566Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=5e10689d-6e34-4fd9-8114-5e0ea063b647",
      "title": null,
      "text": "Originally put gameplay was addictive. I admit game is fun, at first, but once you get past the 100 levels, the game pretty much becomes useless for the people playing for awhile. Scopely has added a ton of bot players that spam the tournaments with ridiculous amount of points that you really don't have a chance to compete with. Also, the prize wheel for upgrading your buildings has been cheapened down. When you have to spend billions, it doesn't balance out",
      "replyDate": "2024-01-31T17:09:42.128Z",
      "replyText": "We're thankful for sharing your thoughts and opinions about the game, Nick. We're sorry that our gameplay mechanics and features affected your gaming experience negatively. Please know that this will be passed onto our team for review so we can better improve your gaming experience. Kindly look forward to better Monopoly Go!",
      "version": "1.16.0",
      "thumbsUp": 39,
      "criterias": []
    },
    {
      "id": "323be165-8a09-4deb-bfa4-1490f2bc7954",
      "userName": "Veronica C",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocI-TedITrcLMpQHq_H3_7UBYisMwEn2EtVBDBIAnbe_=mo",
      "date": "2024-01-27T14:58:58.200Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=323be165-8a09-4deb-bfa4-1490f2bc7954",
      "title": null,
      "text": "It's a cool game to play, but they make it hard to get cards you need to complete the albums. They want you to buy stuff to keep playing, and when you collect duplicate stars to try and trade, which gold can't be traded the safe takes all your goods cards and doesn't give any new cards in the swap so what's the point of opening it. You also have people asking for ridiculous things to trade for a card like this isn't a game we're all playing for fun. You should get more dice a hr and complete lvl",
      "replyDate": "2024-01-28T05:40:55.406Z",
      "replyText": "Thanks for your feedback, Veronica. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 69,
      "criterias": []
    },
    {
      "id": "4844f7a3-ac9f-459f-ba21-ffd06268ac2b",
      "userName": "Cassandra Frazier",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU-m0tWpt_g2pOVG1zuj73iMWYjSdI8Ot3fZFVLDLRE1A",
      "date": "2024-02-13T15:31:31.372Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=4844f7a3-ac9f-459f-ba21-ffd06268ac2b",
      "title": null,
      "text": "Was really liking this game until those partner event. The game started freezing and took my rewards twice. And of course sending a ticket to customer service was a joke!!! Sent a message back saying they were aware of the problem of not being able to add partners witch wasn't even my problem. I even sent screen shots of what was going on and still no response in days. Makes me want to delete the game especially after working hard to get the rewards for them.to take it all away in a glitch!!!",
      "replyDate": "2024-02-14T08:29:13.922Z",
      "replyText": "Hi Cassandra Frazier! We are sorry you are experiencing freezing issues. We are working to fix any issue and we are always available to help you improve your gaming experience. Please contact us in-game so that we can take a look at your account and help you!",
      "version": "1.17.0",
      "thumbsUp": 21,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "2088cbc8-bd1c-4dd0-a2cb-302dc3eeede5",
      "userName": "Danny G",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXJGMZpZHgcQGpLiHYl3oqvK0LHRC2hWOXBXRzlh5trJQIX",
      "date": "2024-02-15T05:11:29.984Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=2088cbc8-bd1c-4dd0-a2cb-302dc3eeede5",
      "title": null,
      "text": "It's fun so far. I'm waiting for the catch. Games this good usually end up disappointing with micro transactions. Edit-I knew this game was too good to be true. I cannot complete the sticker sets without having to spend real money, which I won't or beg for help and you don't get it. (Which I don't do either). My other issue is that bank heist does not work properly. I had 15 minutes worth of mega heist and within those 15 minutes I had 4 bank heist opportunities, none of which were mega heists.",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 3,
      "criterias": [
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_casual",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v2",
          "rating": 2
        }
      ]
    },
    {
      "id": "83a29c32-d45b-46c3-80b6-cd202f9391e1",
      "userName": "Katherine Deitering",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjV66qr-Z3Yo-B0QI-fOl-beqw1DELZ4M7xDCK89Jgw7wEw7",
      "date": "2024-02-19T10:35:07.595Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=83a29c32-d45b-46c3-80b6-cd202f9391e1",
      "title": null,
      "text": "The higher level you become you hardly ever get new cards to finish and dice, they are pricey and it's just really starting to much to get nowhere. I've spent so much on this game and it's literally not fun, not enough shield if you are lucky enough to get them not enough dice a hour you literally just start getting stuck in this game. Unless you want to spend lots of money",
      "replyDate": "2024-02-19T12:53:10.643Z",
      "replyText": "Hello Katherine Deitering! Thank you for sharing your thoughts with us. We're doing our best to keep a good gameplay experience so that everything in the game can be obtained or achieved, whether you are a paying player or not. Your feedback is very much appreciated as we're looking for opportunities to improve our game further.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "27838790-981f-4656-a7e0-32515b1f9a8f",
      "userName": "Sherry Kota",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUpqSvbaTfQ0QnCsOi0b7sBX3RAXZKmZ2pmPLzUz7PxxgZ6",
      "date": "2024-01-26T00:16:28.400Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=27838790-981f-4656-a7e0-32515b1f9a8f",
      "title": null,
      "text": "It's fun to play but the further you get into the game the more fixed it becomes. You have to start to pay to win and I refuse to do that. Paying is cheating in my opinion and it's all set and fixed for what people can get. Everyone on Facebook has the same stickers and it makes it extremely annoying that trades aren't as possible the further you get into collecting them because they only give the same ones over and over. Makes me not want to play anymore 😩😩",
      "replyDate": "2024-01-30T08:49:35.119Z",
      "replyText": "Thank you for sharing your thoughts with us, Sherry. We're doing our best to keep a good gameplay experience so our players get to enjoy the game equally whether spending money on game offers or not. Your feedbacks are collected and we'll keep on looking for opportunities to further improve the game. Kindly look forward to it.",
      "version": "1.16.0",
      "thumbsUp": 116,
      "criterias": []
    },
    {
      "id": "ba612a96-fec6-4f42-afd9-3d4234b8e066",
      "userName": "Loui Roman",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjXwZ4Sy3wmILBCUymCA0G7UP2dpWl70VRkTgtaqXd4LPk8",
      "date": "2024-02-14T21:07:53.664Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=ba612a96-fec6-4f42-afd9-3d4234b8e066",
      "title": null,
      "text": "This game is about money! Everytime they make a change or update it just gets harder. Especially the partners events. It's almost impossible to complete because the wheel just eats up your pieces and just lands on the low numbers. The top event that just finished was on for the duration of the partners event making it even forcing you to keep running out of dice. It's just frustrating that a game that should be fun playing with friends and family is the complete opposite. They don't care about u",
      "replyDate": "2024-02-15T00:21:47.388Z",
      "replyText": "Hello Loui! Thank you for sharing your thoughts about the game. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v2",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_dice",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "2197b71b-c7e4-4c2f-9336-1dcd3098e0d3",
      "userName": "Anna H",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVvFGzLm1EeUtI_xRR91P6qMQeiBWnyE8hLl8eWvJm8pAE",
      "date": "2024-02-16T20:54:54.378Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=2197b71b-c7e4-4c2f-9336-1dcd3098e0d3",
      "title": null,
      "text": "This game has become impossible. I've spent money several times and just burn through rolls without ever getting anything useful. They withhold one sticker from each of the higher packets so you cannot win. If you need to land on a railroad or a utility or whatever to get ahead you won't land on it. It's not just coincidence. It's rigged to make you spend money. It's become more aggravating than fun.",
      "replyDate": "2024-02-17T00:14:51.840Z",
      "replyText": "Hello Anna H! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "f155736d-3c7e-46b6-944c-06762a799754",
      "userName": "Charity Bentley",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocILsTRl0QduVX91qNpYjGF_EWD3i-4Q2YnDTfmAN3YL=mo",
      "date": "2024-02-15T11:41:46.685Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=f155736d-3c7e-46b6-944c-06762a799754",
      "title": null,
      "text": "I originally rated it 4 stars because I really enjoyed the game. Now, not so much. I did a trade last night to get a card a needed, after going and thanking the person, I reopen my monopoly and got a gift of the card I had just traded for. So I ended up with 2. My game crashed 30 minutes later as I was about to make another trade and it disappeared! With proof that I had +1 on it, support said \"everything looks good\" and closed my ticket!! NO, IT IS NOT GOOD!! I WANT MY CARD BACK!!",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "60b0081d-6b0a-4111-8771-62c2ae9e270d",
      "userName": "Ashley K",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocLT5J-v7SGDa1unth1J047X-6Jbk9mzMruyn0BIC0BT=mo",
      "date": "2024-02-08T19:37:40.789Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=60b0081d-6b0a-4111-8771-62c2ae9e270d",
      "title": null,
      "text": "Love it! Issues loading the game today, though... Yes, they only give you a small amount of dice to play every few hours, but overall, I get enough free dice to not have to pay. I enjoy the challenge, the easy \"wins\" of money or building things! The issue today is that I can't start the game. It loads to 8%, then fails and says it has to restart. Then the same thing happens when I try again. That's no way to contact the dev, so I'm posting a review!",
      "replyDate": "2024-02-09T08:48:16.908Z",
      "replyText": "Hi Ashley K! We are sorry you are experiencing loading issues. We are working to fix any issue and we are always available to help you improve your gaming experience. Please contact us in-game so that we can take a look at your account and help you!",
      "version": "1.16.0",
      "thumbsUp": 268,
      "criterias": [
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_games_genre_abstract_strategy",
          "rating": 3
        }
      ]
    },
    {
      "id": "80be1266-5eb8-43a2-ad75-f16f54f554a4",
      "userName": "Aery",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocK1TwZdQR7TAm5EGcFFCMec9EPgofrVy8_fXtHOTLhz=mo",
      "date": "2024-02-13T17:13:19.488Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=80be1266-5eb8-43a2-ad75-f16f54f554a4",
      "title": null,
      "text": "It is fun....when it works. I often get glitches that won't let me into the game ..thus wadting valuable high rollers. Also I've notice a decline in the reward vs \"effort\" in the last few months. Something that will take a lot of time and effort may only reward a blue sticker pack (or similar).",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 6,
      "criterias": []
    },
    {
      "id": "c34267a2-fca9-4e53-b967-144d26c718b6",
      "userName": "Chad Hammond",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUWFzfbqRsUpe5qoxBEStvLhI5c5tB0--V19mImE8ZdsLU",
      "date": "2024-02-14T00:24:16.975Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=c34267a2-fca9-4e53-b967-144d26c718b6",
      "title": null,
      "text": "Has the bells, whistles and color to be a game that can keep the user engaged. It will touch a large audience with its nostalgia alone. The reason for 3 stars is from No fault of the game or devs. I simply prefer an experience that requires a little more on your toes gameplay, not more of an autopilot thing.",
      "replyDate": "2024-02-14T09:44:07.354Z",
      "replyText": "Hi there Chad Hammond. We appreciate you taking the time to share your thoughts with us on how we can better improve your gameplay experience. Rest assured that this will be shared with the team for further consideration so please kindly stay tuned for now.",
      "version": "1.17.0",
      "thumbsUp": 2,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 3
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "31c222ae-5069-4f85-bdc0-ceedbbc204e9",
      "userName": "Enid Harris",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWIYdMuneGTFFMUn5LJv_kBH-jWoTkLMDl52-RxGq8YP7E-",
      "date": "2024-02-20T02:35:24.197Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=31c222ae-5069-4f85-bdc0-ceedbbc204e9",
      "title": null,
      "text": "It's enjoyable to pass the time but I play less due to the amount of dice you get. Having to wait an hour for 10 dice is absurd. Maybe 15mins but let alone 9hrs to reach the 90 dice. Even with collecting the free gifts and playing the top and side games just isn't enough. Trading stickers with friends is okay but trying to find a sticker to trade with non friends is insane. The scammers and cheaters of the system in chat groups I've encountered is just wild and a whole other story! Good luck...",
      "replyDate": null,
      "replyText": null,
      "version": "1.17.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "1b0ab1eb-6c29-4d2a-944c-aec5af33f513",
      "userName": "Amy Bender",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKo7WOmFhzSlNy2rbS7SV2kJ2jD9C1nRVij10NtbEI=mo",
      "date": "2024-02-02T01:47:59.158Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=1b0ab1eb-6c29-4d2a-944c-aec5af33f513",
      "title": null,
      "text": "It's impossible for me to complete my sticker album. I have even paid you REAL MONEY to get extra dice/stickers..etc. for 2 sets of albums now and I STILL have 11 sets to complete. It's frustrating because I haven't gotten a new sticker in about 3 weeks or a month. I'm done spending money on you guys and I'm about ready to quit playing this game altogether 😠",
      "replyDate": "2024-02-02T06:16:08.135Z",
      "replyText": "Hi Amy! Thank you for sharing your thoughts with us. We are doing our best to keep a good gameplay experience, so that everything inside the game can be obtained or achieved, no matter if you are a paying player or not. Of course, we hear you, and we will be looking for opportunities to improve our game further.",
      "version": "1.16.0",
      "thumbsUp": 104,
      "criterias": []
    },
    {
      "id": "39e9d8a8-9034-4026-a552-060d6241fabb",
      "userName": "Devin Toman",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjVPmBmnmO16heU3vfUNKrJUYTSG50MH7JCj4JbRAmoNjQ",
      "date": "2024-01-30T22:52:13.294Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=39e9d8a8-9034-4026-a552-060d6241fabb",
      "title": null,
      "text": "Extremely monetized, extremely unoriginal. This game genuinely feels like a worse board kings with more predatory monetization (go figure). It's fun for a while but after a week or so it's all the same. Edit: It would appear they haven't listened to my feedback or others feedback. If you play the game you'll notice there are suspicious amounts of bots that are always on the same board and never upgrade/repair their board. The events have become even more pay to succeed and not fair at all.",
      "replyDate": "2023-11-28T08:06:03.998Z",
      "replyText": "Thank you for sharing your thoughts with us, Devin. We're doing our best to keep a good gameplay experience so our players get to enjoy the game equally whether spending money on game offers or not. Your feedbacks are collected and we'll keep on looking for opportunities to further improve the game. Kindly look forward to it.",
      "version": "1.16.0",
      "thumbsUp": 41,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 2
        },
        {
          "criteria": "vaf_games_dimensional_plane_3d_v1",
          "rating": 1
        }
      ]
    },
    {
      "id": "674ccff8-48ac-492f-a501-6c64e0021f25",
      "userName": "Sandra Pitts",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocKixQjN-_mGuiXn--ks5inUqOFTx2HCHm3XwyDv2ZEe=mo",
      "date": "2024-02-13T21:31:50.999Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=674ccff8-48ac-492f-a501-6c64e0021f25",
      "title": null,
      "text": "I think this game is getting worse the higher the levels. It's awful it takes me 30 -35 billion to build my landmark only to receive 50 dice for completion 🤦 The rolls are determined,you lose points when the game restarts out of nowhere. 10 dice per hour is ridiculously crazy,not all the gold cards are being added to the blitz only the repeated ones. Scopely has got to do better before they lose a lot of players.",
      "replyDate": "2024-02-14T00:29:26.405Z",
      "replyText": "Hello Sandra! Thank you for your feedback. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "03fa0c81-b794-4acc-a8d3-4703ea273401",
      "userName": "Deone B",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjU7dkF-znX6OObgbrcc6PDj-05pwuSSH-qNagd5CX5v_uv-",
      "date": "2024-01-29T01:00:38.518Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=03fa0c81-b794-4acc-a8d3-4703ea273401",
      "title": null,
      "text": "I like playing this game, I don't like that when you spin the wheel you constantly get one and two star cards. When other games. When the building game with 4 partners comes up, it's harder to reach points when you barely have dice. Everyone doesn't have money all the time to purchase dice. The pick stick game, you expect players to build these large puzzles and barely give us anything to work with. It's starting to get boring.",
      "replyDate": "2024-02-05T13:46:23.756Z",
      "replyText": "Hello Deone B! Your feedback is much appreciated. Rest assured that we are working hard to develop the game and give a better gaming experience for everyone. If you have other concerns, please email us at monopoly-go-support@scopely.com, and we will gladly assist you.",
      "version": "1.16.0",
      "thumbsUp": 54,
      "criterias": []
    },
    {
      "id": "43d55a79-6353-42e3-9cd1-9fa4096a05a8",
      "userName": "Martin Smith",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUrLYI6dEZtesOmbp6xb7XSIw-n-WJ997p1gS_poaeGTKk",
      "date": "2024-02-16T15:14:10.443Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=43d55a79-6353-42e3-9cd1-9fa4096a05a8",
      "title": null,
      "text": "I played this game for a while, it was fun in the beginning, but after playing for a while I realized I was going up against bots and not really competing with real people. I realized the game is rigged and only geared to people who pay alot of money. I don't mind paying or buying in game. Your price per item is ridiculous compared to other games. This game is definitely all about money buy this buy that, I mean I can't turn the game on without 4 screens popping up to buy SOMETHING I'm Done!",
      "replyDate": "2024-03-07T09:50:50.770Z",
      "replyText": "Hi Martin Smith! Thank you for sharing your thoughts about the game features which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "b64404f4-934b-43fe-b6cd-c25d906d8000",
      "userName": "Azumi Nagawa",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWHMyD6D4wBfOsg-xZl4VyZG7P3vCDLWTFGIinIF3qqNQ",
      "date": "2024-02-15T00:54:42.133Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=b64404f4-934b-43fe-b6cd-c25d906d8000",
      "title": null,
      "text": "So partners ended and it is so hard to finish it unlike the previous one, It's so annoying you have to roll your dice collecting points and then you ended getting lower points when rolling the wheel. I consecutively got 400 points on x10 multiply. Second, why the rewards is so low when the points gathering is too high? Not to mention i always spend more dices to get the meager dice and you call that rewards? I feel cheated on this board.",
      "replyDate": "2024-02-16T05:22:52.826Z",
      "replyText": "Hello Azumi! Your feedback is much appreciated. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.17.0",
      "thumbsUp": 1,
      "criterias": []
    },
    {
      "id": "01f9a8d6-72f8-447f-afbd-92e8c89cfe91",
      "userName": "Colton Brown",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocJeSpU9D59gP1HPla-TSMELOE-Tj6fG9m9pngqOPHcr=mo",
      "date": "2024-02-17T01:07:13.464Z",
      "score": 1,
      "scoreText": "1",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=01f9a8d6-72f8-447f-afbd-92e8c89cfe91",
      "title": null,
      "text": "Do not recommend it. The game is fun initially, but get harder and harder the farther you get without having to spend a lot of money. I've been playing for about a year and rewards for events such as partner events, and more have gotten harder to get, and worse rewards every time. The peg-e event just started again, and the rewards are beyond pathetic compared to last time and the time before that and so on. There's no logical reason for it other than greed.",
      "replyDate": "2024-03-07T14:46:49.261Z",
      "replyText": "Hi Colton Brown! Thank you for sharing your thoughts about the game events and rewards which will be shared with the team. Rest assured that we are dedicated to improve your gaming experience so please stay tuned for future developments.",
      "version": "1.17.0",
      "thumbsUp": 0,
      "criterias": []
    },
    {
      "id": "80bc3a3d-f9c7-4cdd-a1f4-e1d6b43bcd0a",
      "userName": "herb welch",
      "userImage": "https://play-lh.googleusercontent.com/a/ACg8ocIZOsDsG5BJ05OD0dvKX7Uh6drdb57KDb2fxmLrj6yk=mo",
      "date": "2024-02-01T16:32:13.155Z",
      "score": 4,
      "scoreText": "4",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=80bc3a3d-f9c7-4cdd-a1f4-e1d6b43bcd0a",
      "title": null,
      "text": "Like the the game, but rolls aren't random. The properties that you need to collect prizes at the board changes dramatically depending on the properties you need. Needed chance, comm. chest and railroads landed there 1.3% of the time. Next needed utilities and taxes landed there .09% of the time, while landing on railroads, chance and comm. Chest more than 30% of the time. Don't think my luck changes that dramatically but maybe it does. It does happen whenever the properties change. Just saying",
      "replyDate": null,
      "replyText": null,
      "version": "1.16.0",
      "thumbsUp": 43,
      "criterias": []
    },
    {
      "id": "dabfce51-b7a8-4799-8986-f40d40f3bf67",
      "userName": "Michelle “Karma” Justice",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWkcS_tPgq9DOFMF2ws3uS1rSFig2jYK_EggI0Jbw9Ddxg",
      "date": "2024-02-12T21:53:57.724Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=dabfce51-b7a8-4799-8986-f40d40f3bf67",
      "title": null,
      "text": "The game overall is fun but there are a few things that I would change; The Gold blitz event should be more often and it's insane that we don't get to choose which gold sticker to gift for the simple fact that the event happens once in a blue moon. That's so lame. Monopoly is also SUPER stingy with their four and five star stickers. You won't go bankrupt by adding a few 4 star stickers in the prizes. And I think it's bogus that I got 800 when I was on a 6x for the partner event.",
      "replyDate": "2024-02-12T22:37:45.249Z",
      "replyText": "Hello Michelle! Thank you for your feedback. Rest assured that we are working hard to improve the game and make it a better experience for everyone. If you have any further questions concerning the game, please contact us at monopoly-go-support@scopely.com, and we will gladly help you.",
      "version": "1.16.0",
      "thumbsUp": 120,
      "criterias": [
        {
          "criteria": "vaf_games_offline_v1",
          "rating": 2
        }
      ]
    },
    {
      "id": "876076eb-035a-4ad4-b837-ebf715518071",
      "userName": "Steven Luca",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjWaGabCGqCzh3UX3P0GRa7gMJMiq1RDBDUHZkGH2p1v2so",
      "date": "2024-02-09T00:41:34.823Z",
      "score": 2,
      "scoreText": "2",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=876076eb-035a-4ad4-b837-ebf715518071",
      "title": null,
      "text": "This game is addictive! However there needs to be more ways to earn free dice! Even with in app purchases the items are not enough for the price. Its a 10min or less playing then done for hours. I also think there isn't a chance to finish albums without trading on Facebook. Which I have never figured out how to manage that. I'm on level 87 and still have no clue. I think the game needs to give hundreds of daily dice for players to keep playing.",
      "replyDate": "2024-02-09T03:33:56.420Z",
      "replyText": "Thanks for your feedback, Steven. We appreciate you sending us this concern regarding your game experience. We pay attention to the comments shared by Monopoly GO! players, as it helps us to improve the player experience. We'll make sure to share your thoughts with the team! Thank you!",
      "version": "1.16.0",
      "thumbsUp": 29,
      "criterias": []
    },
    {
      "id": "8fea0c2b-9540-4764-8184-accbc37589fa",
      "userName": "Jamillet Parada",
      "userImage": "https://play-lh.googleusercontent.com/a-/ALV-UjUgxP45XjuMi4vzSwzvOr4hvH9VgA17okAiBz9A1x5SNJo",
      "date": "2024-01-27T13:02:51.865Z",
      "score": 3,
      "scoreText": "3",
      "url": "https://play.google.com/store/apps/details?id=com.scopely.monopolygo&reviewId=8fea0c2b-9540-4764-8184-accbc37589fa",
      "title": null,
      "text": "The game is fun BUT if you're someone who gives into in game purchases easily, I don't recommend. The pay wall is constantly being shoved in your face trying to get you to purchase something. It is a really fun game to play with friends but it will get expensive very quickly if you don't have self control. Even if you make a purchase there is rarely a guarantee you will get what you want/need from the sticker packs. You will only get these from guaranteed packs and they are not cheap.",
      "replyDate": "2024-01-30T08:49:08.440Z",
      "replyText": "Thank you for sharing your thoughts with us, Jamillet. We're doing our best to keep a good gameplay experience so our players get to enjoy the game equally whether spending money on game offers or not. Your feedbacks are collected and we'll keep on looking for opportunities to further improve the game. Kindly look forward to it.",
      "version": "1.16.0",
      "thumbsUp": 66,
      "criterias": [
        {
          "criteria": "vaf_games_multi_player_v1",
          "rating": 1
        },
        {
          "criteria": "vaf_games_genre_dice",
          "rating": 1
        },
        {
          "criteria": "vaf_games_graphic_style_stylized_v2",
          "rating": 3
        }
      ]
    }
  ],
  "nextPaginationToken": "CnAKbgpsMCwxMDAxMDAwLjc0NzY3MTA2NzcsNzQ3NTIzMzY5MzAyLCJodHRwOi8vbWFya2V0LmFuZHJvaWQuY29tL2RldGFpbHM_aWQ9djI6Y29tLnNjb3BlbHkubW9ub3BvbHlnbzoxIiwxLGZhbHNl"
}